wkxboot/nrf51_sdk_v12_3_0/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_smart_locker/main.c
//    APP_ERROR_CHECK(err_code);

//    // Prepare wakeup buttons.
//    err_code = bsp_btn_ble_sleep_mode_prepare();
//    APP_ERROR_CHECK(err_code);

//    // Go to system-off mode (this function will not return; wakeup will cause a reset).
//    err_code = sd_power_system_off();
//    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    uint32_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            NRF_LOG_INFO("Fast advertising\r\n");
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_ADV_EVT_IDLE:
             NRF_LOG_INFO("adverting idle\r\n");//sleep_mode_enter();
            break;

        default:
            break;
    }
}


/**@brief Function for handling the Application's BLE Stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t err_code = NRF_SUCCESS;
    ble_gap_sec_params_t sec_param={0};
    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_INFO("smart locker ble4.0 Disconnected.\r\n");
				
				    //err_code = pm_peers_delete();
            //APP_ERROR_CHECK(err_code);
            err_code = bsp_indication_set(BSP_INDICATE_IDLE);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GAP_EVT_DISCONNECTED

        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("smart locker ble4.0 Connected.\r\n");
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
				    
			    	sec_param.bond=SEC_PARAM_BOND;
				    sec_param.mitm=SEC_PARAM_MITM;
				    err_code=sd_ble_gap_authenticate(m_conn_handle,&sec_param);//直接请求安全认证
				    APP_ERROR_CHECK(err_code); 
            break; // BLE_GAP_EVT_CONNECTED
        case BLE_GAP_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            NRF_LOG_DEBUG("adverting Timeout.\r\n");
            break; // BLE_GATTC_EVT_TIMEOUT
        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            NRF_LOG_DEBUG("GATT Client Timeout.\r\n");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTC_EVT_TIMEOUT

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            NRF_LOG_DEBUG("GATT Server Timeout.\r\n");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_TIMEOUT

        case BLE_EVT_USER_MEM_REQUEST:
            err_code = sd_ble_user_mem_reply(p_ble_evt->evt.gattc_evt.conn_handle, NULL);
            APP_ERROR_CHECK(err_code);
            break; // BLE_EVT_USER_MEM_REQUEST
        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
        {
            ble_gatts_evt_rw_authorize_request_t  req;
            ble_gatts_rw_authorize_reply_params_t auth_reply;

            req = p_ble_evt->evt.gatts_evt.params.authorize_request;

            if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
            {
                if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
                {
                    if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                    }
                    else
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                    }
                    auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
                    err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                               &auth_reply);
                    APP_ERROR_CHECK(err_code);
                }
            }
        } break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST

#if (NRF_SD_BLE_API_VERSION == 3)
        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
            err_code = sd_ble_gatts_exchange_mtu_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                       NRF_BLE_MAX_MTU_SIZE);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST
#endif

        default:
            // No implementation needed.
            break;
    }
}


//链路认证（配对）密码设置，静态或者随机或者无
static void pairing_and_bonding_init()
{
	uint32_t err_code;
	ble_opt_t opt;
	opt.gap_opt.passkey.p_passkey=SMART_LOCKER_PASSKEY_STATIC;
	err_code=sd_ble_opt_set(BLE_GAP_OPT_PASSKEY,&opt);
  APP_ERROR_CHECK(err_code);
	
}


//链路认证（配对）结果处理

/**@brief Function for processing the @ref BLE_GAP_EVT_AUTH_STATUS event from the SoftDevice.
 *
 * @param[in]  p_gap_evt  The event from the SoftDevice.
 */
static void auth_status_process(ble_gap_evt_t * p_gap_evt)
{
	  uint32_t auth_status,err_code;
	  auth_status=p_gap_evt->params.auth_status.auth_status;
    switch (auth_status)
    {
        case BLE_GAP_SEC_STATUS_SUCCESS:
        NRF_LOG_INFO("配对成功，链路已加密！！\r\n");
        break;

        default:
				NRF_LOG_INFO("链路认证状态值：%d\r\n",auth_status);
        NRF_LOG_INFO("配对失败，链路没有加密！主动断开连接！\r\n");
			  err_code = sd_ble_gap_disconnect(m_conn_handle,
                                        BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        if (err_code != NRF_ERROR_INVALID_STATE)
         {
            APP_ERROR_CHECK(err_code);
         }
    }
}

//配对和链路认证处理过程，这个过程在security_manager.c中已经有处理的，代码在这里只是为了查看这个过程
static void pairing_on_ble_evt(ble_evt_t * p_ble_evt)
{
	ble_gap_sec_params_t sec_param;
	uint8_t *ppasskey;
	switch(p_ble_evt->header.evt_id)
	{
		case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
		sec_param=p_ble_evt->evt.gap_evt.params.sec_params_request.peer_params;
		NRF_LOG_INFO("收到配对请求！\r\nsec_param.bond:%d\r\nsec_param.io_caps:%d\r\nsec_param.keypress:%d\r\n",sec_param.bond,sec_param.io_caps,sec_param.keypress);
		break;
		case BLE_GAP_EVT_PASSKEY_DISPLAY:
		ppasskey=p_ble_evt->evt.gap_evt.params.passkey_display.passkey;	
		NRF_LOG_INFO("收到密码显示请求，密码为：\r\nnpasskey->%s\r\n",(uint32_t)ppasskey);
		break;
		case BLE_GAP_EVT_AUTH_STATUS://链路认证（配对）结果
    auth_status_process(&(p_ble_evt->evt.gap_evt));
    break;
		default:
			
	  break;
		
		
